12/data/attachments/d734c799e081f486.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_d576d136-7db5-41f1-bde4-2b4e07f990f4</nif:username>
            <nif:friendToBeAdded>Martha_market_Friend_79659_8</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>